IRP/src/Enums/IncomingPaymentTransactionType/IncomingPaymentTransactionType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>IncomingPaymentTransactionType</name>
  <enumValues>
    <name>PaymentFromCustomer</name>
  </enumValues>
  <enumValues>
    <name>CurrencyExchange</name>
  </enumValues>
  <enumValues>
    <name>CashTransferOrder</name>
  </enumValues>
  <enumValues>
    <name>TransferFromPOS</name>
  </enumValues>
  <enumValues>
    <name>ReturnFromVendor</name>
  </enumValues>
  <enumValues>
    <name>PaymentFromCustomerByPOS</name>
  </enumValues>
  <enumValues>
    <name>ReceiptByCheque</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Enums/IncomingPaymentTransactionType/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	StandardProcessing = False;
	ChoiceData = New ValueList();
	ChoiceData.Add(Enums.IncomingPaymentTransactionType.PaymentFromCustomer);
	ChoiceData.Add(Enums.IncomingPaymentTransactionType.CurrencyExchange);
	ChoiceData.Add(Enums.IncomingPaymentTransactionType.CashTransferOrder);
	ChoiceData.Add(Enums.IncomingPaymentTransactionType.TransferFromPOS);
	ChoiceData.Add(Enums.IncomingPaymentTransactionType.ReturnFromVendor);
	If Parameters.Filter.Property("Ref") And TypeOf(Parameters.Filter.Ref) = Type("DocumentRef.BankReceipt") Then
		ChoiceData.Add(Enums.IncomingPaymentTransactionType.PaymentFromCustomerByPOS);
		ChoiceData.Add(Enums.IncomingPaymentTransactionType.ReceiptByCheque);
	EndIf;
EndProcedure
